Управление_торговлей_демо/src/DataProcessors/ПомощникИсправленияОстатковТоваровОрганизаций/ПомощникИсправленияОстатковТоваровОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникИсправленияОстатковТоваровОрганизаций</name>
  <attributes>
    <name>МесяцИсправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозицийОтрицательныйОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозицийРазвернутоеСальдо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозицийОтрицательныйОстатокБыло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозицийРазвернутоеСальдоБыло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПереформированиеРезервов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяИсправлениеРазвернутогоСальдо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРазвернутогоСальдо</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияРазвернутогоСальдо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатКонтроляОформления</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КорректировкиРезервов</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.КорректировкаРегистров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсправленияОстатковТоваровОрганизаций</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ИсправлениеРазвернутогоСальдоТоваровОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмененныеДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыданСчетФактура</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераГТДИзменились</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НовыеНастройкиПередачиМеждуОрганизациями</name>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Продавец</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗапасовВладельца</name>
      <type>
        <types>EnumRef.ТипыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаПередачи</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КорректировкиРезервовПоНовымНастройкам</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.КорректировкаРегистров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспоряженияНаОформлениеОприходований</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПозиций</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеДляЗаполненияОприходований</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОрганизацииДляФормированияПередач</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗапасов</name>
      <type>
        <types>EnumRef.ТипыЗапасов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсправительныеСчетаФактуры</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.СчетФактураВыданный</types>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DefinedType.ОснованиеСчетФактураВыданный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыКПерезаполнению</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборыДляФормированияПередач</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗапасов</name>
      <type>
        <types>EnumRef.ТипыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборыДляФормированияОтчетаКонтроля</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Управление_торговлей_демо/src/AccumulationRegisters/ТоварыОрганизаций/ТоварыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыОрганизаций</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПоРНПТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюСписанияПоРНПТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияОтгрузки</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
      <types>DocumentRef.МаркировкаТоваровГИСМ</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Первичное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПартияПроизводства</name>
    <type>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей_демо/src/DataProcessors/ПомощникИсправленияОстатковТоваровОрганизаций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Выполняет методы модуля объекта обработки помощника исправления.
//
// Параметры:
//  Параметры - Структура - Структура с полями:
//		* СтруктураОбъектаОбработки - Структура - Структура, из которой будет восстановлен объект обработки. Поля структуры должны совпадать с
//			полями метаданных обработки ПомощникИсправленияОстатковТоваровОрганизаций.
//		* ИменаМетодов - Массив - Массив строк с именами методов, которые нужно выполнить.
//		* ПараметрыМетодов - Структура - Структура, где ключи совпадают с именами методов, а значения содержат массивы параметров этих методов.
//  АдресРезультата - Строка - Адрес во временное хранилище, по которому нужно поместить структуру объекта после выполнения всех методов.
//  ОбработкаОбъект	- ОбработкаОбъект.ПомощникИсправленияОстатковТоваровОрганизаций - объект обработки, если его не нужно восстанавливать из
//		структуры.
//
Процедура ВыполнитьМетодыОбъекта(Параметры, АдресРезультата = Неопределено, ОбработкаОбъект = Неопределено) Экспорт
	
	Если ОбработкаОбъект = Неопределено Тогда
		ОбработкаОбъект = ОбработкаОбъект(Параметры.СтруктураОбъектаОбработки);
	КонецЕсли;
	
	КраткоеПредставлениеОшибки = "";
	
	Методы = СтрРазделить(Параметры.ИменаМетодов, ",");
	Для Каждого Метод Из Методы Цикл
		Попытка
			Метод = СокрЛП(Метод);
			Если Метод = "ОбновитьДанныеПоОтрицательнымОстаткамИСальдо" Тогда
				ОбработкаОбъект.ОбновитьДанныеПоОтрицательнымОстаткамИСальдо();
			ИначеЕсли Метод = "ЗаполнитьМесяцИсправления" Тогда
				ОбработкаОбъект.ЗаполнитьМесяцИсправления();
			ИначеЕсли Метод = "СформироватьНовыеРезервы" Тогда
				ОбработкаОбъект.СформироватьНовыеРезервы();
			ИначеЕсли Метод = "СформироватьНовыеРезервыПоНовымНастройкам" Тогда
				ОбработкаОбъект.СформироватьНовыеРезервыПоНовымНастройкам();
			ИначеЕсли Метод = "СформироватьИсправленияРазвернутогоСальдо" Тогда
				ОбработкаОбъект.СформироватьИсправленияРазвернутогоСальдо();
			ИначеЕсли Метод = "ТипыЗачетаОстатковРазвернутогоСальдо" Тогда
				ОбработкаОбъект.ТипыЗачетаОстатковРазвернутогоСальдо();
			ИначеЕсли Метод = "ПерезаполнитьВидыЗапасов" Тогда
				ОбработкаОбъект.ПерезаполнитьВидыЗапасов();
			ИначеЕсли Метод = "ЗаполнитьНовыеНастройкиПередачи" Тогда
				ОбработкаОбъект.ЗаполнитьНовыеНастройкиПередачи();
			ИначеЕсли Метод = "ЗаполнитьРаспоряженияНаОформлениеОприходований" Тогда
				ОбработкаОбъект.ЗаполнитьРаспоряженияНаОформлениеОприходований();
			ИначеЕсли Метод = "ЗаполнитьТребуетсяПереформированиеРезервов" Тогда
				ОбработкаОбъект.ЗаполнитьТребуетсяПереформированиеРезервов();
			ИначеЕсли Метод = "ЗаполнитьТребуетсяИсправлениеРазвернутогоСальдо" Тогда
				ОбработкаОбъект.ЗаполнитьТребуетсяИсправлениеРазвернутогоСальдо();
			ИначеЕсли Метод = "СформироватьИсправительныеСчетаФактуры" Тогда
				ОбработкаОбъект.СформироватьИсправительныеСчетаФактуры();
			ИначеЕсли Метод = "СформироватьРезультатКонтроляОформленияДокументовТовародвижения" Тогда
				ОбработкаОбъект.СформироватьРезультатКонтроляОформленияДокументовТовародвижения(
					Параметры.ПараметрыМетодов.СформироватьРезультатКонтроляОформленияДокументовТовародвижения[0],
					Параметры.ПараметрыМетодов.СформироватьРезультатКонтроляОформленияДокументовТовародвижения[1]);
			ИначеЕсли Метод = "Инициализировать" Тогда
				ОбработкаОбъект.Инициализировать();
			Иначе
				ТекстИсключения = НСтр("ru = 'Работа с методом %Метод% не поддерживается'");
				ТекстИсключения = СтрЗаменить(ТекстИсключения, "%Метод%", Метод);
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
			Прервать;
		КонецПопытки;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(ОбработкаОбъект.СтруктураДанных(), АдресРезультата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КраткоеПредставлениеОшибки) Тогда
		ВызватьИсключение КраткоеПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры

// Запрос детальные остатки на конец месяца исправления.
// 
// Параметры:
//  МесяцИсправления - Дата
// 
// Возвращаемое значение:
//  Запрос - Запрос детальные остатки на конец месяца исправления
//
Функция ЗапросДетальныеОстаткиНаКонецМесяцаИсправления(МесяцИсправления) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СформироватьВТКонтролируемыеВидыЗапасов(МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиНаКонецМесяцаИсправления.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ОстаткиНаКонецМесяцаИсправления.Организация КАК Организация,
	|	ОстаткиНаКонецМесяцаИсправления.ВидЗапасов КАК ВидЗапасов,
	|	ОстаткиНаКонецМесяцаИсправления.НомерГТД КАК НомерГТД,
	|	СУММА(ОстаткиНаКонецМесяцаИсправления.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ДетальныеОстаткиНаКонецМесяцаИсправления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ТоварыОрганизацийОстатки.Организация КАК Организация,
	|		ТоварыОрганизацийОстатки.ВидЗапасов КАК ВидЗапасов,
	|		ТоварыОрганизацийОстатки.НомерГТД КАК НомерГТД,
	|		ТоварыОрганизацийОстатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				&ГраницаИсправления,
	|				ВидЗапасов В
	|					(ВЫБРАТЬ
	|						ВТКонтролируемыеВидыЗапасов.Ссылка
	|					ИЗ
	|						ВТКонтролируемыеВидыЗапасов)) КАК ТоварыОрганизацийОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры,
	|		РезервыТоваровОрганизаций.Организация,
	|		РезервыТоваровОрганизаций.ВидЗапасов,
	|		РезервыТоваровОрганизаций.НомерГТД,
	|		РезервыТоваровОрганизаций.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.РезервыТоваровОрганизаций.Остатки(
	|				&ГраницаИсправления,
	|				ВидЗапасов В
	|					(ВЫБРАТЬ
	|						ВТКонтролируемыеВидыЗапасов.Ссылка
	|					ИЗ
	|						ВТКонтролируемыеВидыЗапасов)) КАК РезервыТоваровОрганизаций) КАК ОстаткиНаКонецМесяцаИсправления
	|
	|ГДЕ
	|	НЕ ОстаткиНаКонецМесяцаИсправления.АналитикаУчетаНоменклатуры.Номенклатура.ВестиУчетПоГТД
	|	ИЛИ (ОстаткиНаКонецМесяцаИсправления.АналитикаУчетаНоменклатуры.Номенклатура.ВестиУчетПоГТД
	|		И ОстаткиНаКонецМесяцаИсправления.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНаКонецМесяцаИсправления.АналитикаУчетаНоменклатуры,
	|	ОстаткиНаКонецМесяцаИсправления.Организация,
	|	ОстаткиНаКонецМесяцаИсправления.ВидЗапасов,
	|	ОстаткиНаКонецМесяцаИсправления.НомерГТД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	ВидЗапасов,
	|	НомерГТД";
	Запрос.УстановитьПараметр("ГраницаИсправления", Новый Граница(КонецМесяца(МесяцИсправления), ВидГраницы.Включая));
	Возврат Запрос;

КонецФункции

// Сформировать ВТКонтролируемые виды запасов.
// 
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц
//
Процедура СформироватьВТКонтролируемыеВидыЗапасов(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыЗапасов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТКонтролируемыеВидыЗапасов
	|ИЗ
	|	Справочник.ВидыЗапасов КАК ВидыЗапасов
	|ГДЕ
	|	ВидыЗапасов.ТипЗапасов В (&КонтролируемыеТипыЗапасов)";
	Запрос.Параметры.Вставить("КонтролируемыеТипыЗапасов", Перечисления.ТипыЗапасов.КонтролируемыеТипыЗапасов());
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработкаОбъект(СтруктураОбъектаОбработки)
	
	ОбработкаОбъект = Обработки.ПомощникИсправленияОстатковТоваровОрганизаций.Создать();
	Для Каждого ПолеСтруктуры Из СтруктураОбъектаОбработки Цикл
		Если ТипЗнч(ПолеСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
			ОбработкаОбъект[ПолеСтруктуры.Ключ].Загрузить(ПолеСтруктуры.Значение);
		Иначе
			ОбработкаОбъект[ПолеСтруктуры.Ключ] = ПолеСтруктуры.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбработкаОбъект;
	
КонецФункции

#КонецОбласти

#КонецЕсли
